Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/reference.tmx
Source language: en
Languages: pl

source: Some objects contain references to "external" resources such as open files or windows. It is understood that these resources are freed when the object is garbage-collected, but since garbage collection is not guaranteed to happen, such objects also provide an explicit way to release the external resource, usually a :meth:`close` method. Programs are strongly recommended to explicitly close such objects. The ':keyword:`try`...\ :keyword:`finally`' statement and the ':keyword:`with`' statement provide convenient ways to do this.
pl: Niektóre obiekty zawierają odniesienia do "zewnętrznych" zasobów, takich jak otwarte pliki lub okna. Przyjmuje się, że zasoby te są zwalniane, gdy obiekt podlega zbieraniu śmieci, ale ponieważ nie gwarantuje się, że zbieranie śmieci nastąpi, takie obiekty również dostarczają specjalnych sposobów, zwykle metodę :meth:`close` służcą do zwalniania zewnętrznych zasobów. Szczególnie zaleca się aby programy jawnie zamykały takie obiekty. Instrukcja ':keyword:`try`...\ :keyword:`finally`' i instrukcja ':keyword:`with`' zapewniają użyteczne sposoby służące temu celowi.

source: Some objects contain references to other objects; these are called *containers*. Examples of containers are tuples, lists and dictionaries. The references are part of a container's value. In most cases, when we talk about the value of a container, we imply the values, not the identities of the contained objects; however, when we talk about the mutability of a container, only the identities of the immediately contained objects are implied. So, if an immutable container (like a tuple) contains a reference to a mutable object, its value changes if that mutable object is changed.
pl: Niektóre obiekty zawierają odniesienia do innych obiektów; są to tak zwane *pojemniki*. Przykładami pojemników są krotki, listy i słowniki. Odniesienia są częścią wartości pojemnika. W większości przypadków, kiedy mówimy o wartości pojemnika, to mamy na myśli wartości, a nie identyfikatory znajdujących się wewnątrz obiektów; jednakże, jeśli mówimy o mutowalności pojemnika, mamy na myśli wyłącznie identyfikatory bezpośrednio zawartych obiektów. Tak więc, jeśli niemutowalny pojemnik (taki, jak krotka) zawiera odniesienie do mutowalnego obiektu, to jego wartość zmienia się jeśli mutowalny obiekt zostanie zmieniony.

source: Types affect almost all aspects of object behavior. Even the importance of object identity is affected in some sense: for immutable types, operations that compute new values may actually return a reference to any existing object with the same type and value, while for mutable objects this is not allowed. E.g., after ``a = 1; b = 1``, ``a`` and ``b`` may or may not refer to the same object with the value one, depending on the implementation, but after ``c = []; d = []``, ``c`` and ``d`` are guaranteed to refer to two different, unique, newly created empty lists. (Note that ``c = d = []`` assigns the same object to both ``c`` and ``d``.)
pl: Typy wpływają niemal na wszystkie aspekty zachowania obiektu. Nawet znaczenie identyfikatora obiektu zależy od nich w pewnym sensie: dla typów niemutowalnych, operacje, które obliczają nowe wartości mogą w rzeczywistości zwrócić odwołanie do istniejącego obiektu o tym samym typie i wartości, natomiast w przypadku mutowalnych obiektów nie jest to dozwolone. Np. po ``a = 1; b = 1``, ``a`` i ``b`` mogą odnosić się, lub mogę nie odnosić się do tego samego obiektu o wartości jeden, w zależności od implementacji, ale po ``c = []; d = []``, gwarantuje się, że ``c`` i ``d`` będą odwoływały się do dwóch różnych, niepowtarzalnych, nowo utworzonych pustych list. (Należy zwrócić uwagę, że ``c = d = []`` przypisuje ten sam obiekt zarówno do ``c`` jak i do ``d``.)

source: The standard type hierarchy
pl: Standardowa hierarchia typów

source: Below is a list of the types that are built into Python. Extension modules (written in C, Java, or other languages, depending on the implementation) can define additional types. Future versions of Python may add types to the type hierarchy (e.g., rational numbers, efficiently stored arrays of integers, etc.), although such additions will often be provided via the standard library instead.
pl: Poniżej znajduje się lista typów wbudowanych w Pythonie. Moduły rozszerzeń (napisane w C, Javie lub innych językach, w zależności od implementacji) mogą definiować dodatkowe typy. Przyszłe wersje Pythona mogą dodawać typy do hierarchii typów (np. liczby wymierne, wydajnie składowane tablice liczb, itp.), chociaż takie dodatki często będą w zastępstwie dostarczane za pośrednictwem standardowej biblioteki.

source: Some of the type descriptions below contain a paragraph listing 'special attributes.' These are attributes that provide access to the implementation and are not intended for general use. Their definition may change in the future.
pl: Niektóre poniższych opisów typów zawierają ustęp wyszczegulniający 'specjalne atrybuty.' Są to cechy, które zapewniają dostęp do implementacji i nie są przeznaczone do ogólnego użytku. Ich definicja może się zmienić w przyszłości.

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``None``. It is used to signify the absence of a value in many situations, e.g., it is returned from functions that don't explicitly return anything. Its truth value is false.
pl: Ten typ ma pojedynczą wartość. Istnieje jeden obiekt z tą wartością. Ten obiekt jest dostępny za pośrednictwem wbudowanej nazwy ``None``. Jest on używany do oznaczenia brak wartości w wielu sytuacjach, na przykład, jest ona zwracana z funkcji, które wyraźnie nic nie zwracają. Jego wartością w sensie logicznym jest fałsz.

source: This type has a single value. There is a single object with this value. This object is accessed through the built-in name ``NotImplemented``. Numeric methods and rich comparison methods may return this value if they do not implement the operation for the operands provided. (The interpreter will then try the reflected operation, or some other fallback, depending on the operator.) Its truth value is true.
pl: Ten typ ma pojedynczą wartość. Istnieje jeden obiekt o tej wartości. Ten obiekt jest dostępny przez wbudowaną nazwę ``NotImplemented``. Metody numeryczne i wielorakie metody porównawcze mogą zwracać tą wartość, jeśli nie implementują jakiejś operacji dla dostarczonych argumentów. (Interpreter będzie wtedy próbował operacji zreflektowanej lub jakiejś innej zastępczej operacji, w zależności od operatora.) Jego wartością w sensie logicznym jest prawda.

source: This type has a single value. There is a single object with this value. This object is accessed through the literal ``...`` or the built-in name ``Ellipsis``. Its truth value is true.
pl: Ten typ ma pojedynczą wartość. Istnieje jeden obiekt o tej wartości. Ten obiekt jest dostępny przez literał ``...`` lub przez nazwę wbudowaną ``Ellipsis``. Jego wartością logiczną jest prawda.

source: These are created by numeric literals and returned as results by arithmetic operators and arithmetic built-in functions. Numeric objects are immutable; once created their value never changes. Python numbers are of course strongly related to mathematical numbers, but subject to the limitations of numerical representation in computers.
pl: Te oto są tworzone przez literały liczbowe i zwracane jako wyniki przez operatory arytmetyczne i wbudowane funkcje arytmetyczne. Obiekty numeryczne są niemutowalne, po utworzeniu ich wartość nigdy nie jest zmieniana. Liczby Pythona są oczywiście silnie związane z liczbami matematycznymi, ale z zastrzeżeniem ograniczeń reprezentacji liczb w komputerach.

source: Python distinguishes between integers, floating point numbers, and complex numbers:
pl: Python rozróżnia liczby całkowite, liczby zmiennoprzecinkowe i liczby zespolone:

source: These represent elements from the mathematical set of integers (positive and negative).
pl: Te stanowią elementy z matematycznego zbioru liczb całkowitych (dodatnich i ujemnych).

source: There are two types of integers:
pl: Istnieją dwa rodzaje liczb całkowitych:

source: Integers (:class:`int`)
pl: Liczby całkowite (:class:`int`)

source: These represent numbers in an unlimited range, subject to available (virtual) memory only. For the purpose of shift and mask operations, a binary representation is assumed, and negative numbers are represented in a variant of 2's complement which gives the illusion of an infinite string of sign bits extending to the left.
pl: Te stanowią liczby o nieograniczonym zakresie, jedynie z zastrzeżeniem ograniczenia w ramach dostępnej (wirtualnej) pamięci. Dla potrzeb operacji przesuwania i maskowania, przyjęta jest reprezentacja binarna, a wartości ujemne są reprezentowane w wariancie kodu uzupełnień do 2, która daje wrażenie nieskończonego ciągu bitów znaku rozciągających się po lewej stronie.

source: These represent the truth values False and True. The two objects representing the values False and True are the only Boolean objects. The Boolean type is a subtype of the integer type, and Boolean values behave like the values 0 and 1, respectively, in almost all contexts, the exception being that when converted to a string, the strings ``"False"`` or ``"True"`` are returned, respectively.
pl: Te stanowią wartości logiczne fałszu i prawdy. Te dwa obiekty reprezentujące wartości False i True są jedynymi obiektami typu Boolean. Typ Boolean jest podtypem typu całkowitego i wartości typu Boolean zachowują się jak wartości 0 i 1, odpowiednio, w prawie wszystkich kontekstach, z wyjątkiem tego, że po przekonwertowaniu na łańcuch znaków, łańcuchy ``"False"`` lub ``"True"`` są odpowiednio zwracane.

source: The rules for integer representation are intended to give the most meaningful interpretation of shift and mask operations involving negative integers.
pl: Zasady reprezentacji liczb całkowitych mają na celu dostarczenie najbardziej znaczącej interpretacji operacji przesunięcia i maskowania z uwzględnieniem liczb całkowitych ujemnych.

source: These represent machine-level double precision floating point numbers. You are at the mercy of the underlying machine architecture (and C or Java implementation) for the accepted range and handling of overflow. Python does not support single-precision floating point numbers; the savings in processor and memory usage that are usually the reason for using these is dwarfed by the overhead of using objects in Python, so there is no reason to complicate the language with two kinds of floating point numbers.
pl: Te reprezentują liczby zmiennoprzecinkowe na poziomie maszynowym podwójnej precyzji. Jesteś na łasce leżącej u podstaw architektury maszynowej (i implementacji C lub Javy) dla przyjętego zakresu i sposobu obsługi przepełnienia. Python nie obsługuje liczb zmiennoprzecinkowych pojedynczej precyzji; oszczędności w wykorzystaniu procesora i pamięci, które są zazwyczaj powodem korzystania z nich są znacznie niższe od narzutu użycia obiektów w Pythonie, więc nie ma powodu, aby komplikować język z dwoma rodzajami liczb zmiennoprzecinkowych.

source: These represent complex numbers as a pair of machine-level double precision floating point numbers. The same caveats apply as for floating point numbers. The real and imaginary parts of a complex number ``z`` can be retrieved through the read-only attributes ``z.real`` and ``z.imag``.
pl: Te stanowią liczby zespolone jako pary liczb zmiennoprzecinkowych podwójnej precyzji na poziomie maszynowym. Obowiązują te same zastrzeżenia co w przypadku liczb zmiennoprzecinkowych. Części rzeczywista i urojona liczby zespolonej ``z`` mogą być odczytane przez odwołanie się do atrybutów tylko do odczytu ``z.real`` i ``z.imag``.

source: These represent finite ordered sets indexed by non-negative numbers. The built-in function :func:`len` returns the number of items of a sequence. When the length of a sequence is *n*, the index set contains the numbers 0, 1, ..., *n*-1. Item *i* of sequence *a* is selected by ``a[i]``.
pl: Te oto stanowią skończone uporządkowane zbiory indeksowane przez liczby nieujemne. Wbudowana funkcja :func:`len` zwraca liczbę elementów w sekwencji. Gdy długość sekwencji jest *n*, zbiór indeksów zawiera liczby 0, 1, ..., *n*-1. Element *i* sekwencji *a* jest wybierany przez ``a[i]``.

source: Sequences also support slicing: ``a[i:j]`` selects all items with index *k* such that *i* ``<=`` *k* ``<`` *j*. When used as an expression, a slice is a sequence of the same type. This implies that the index set is renumbered so that it starts at 0.
pl: Sekwencje obsługują również wycinki: ``a[i:j] `` wybiera wszystkie elementy z indeksem *k* takie, że *i* ``<=`` *k* ``<`` *j*. Gdy stosowane jako wyrażenie, wycinek jest sekwencją tego samego typu. Oznacza to, że zbiór indeksów jest przenumerowany tak, że rozpoczyna się od 0.

source: Some sequences also support "extended slicing" with a third "step" parameter: ``a[i:j:k]`` selects all items of *a* with index *x* where ``x = i + n*k``, *n* ``>=`` ``0`` and *i* ``<=`` *x* ``<`` *j*.
pl: Niektóre sekwencje obsługują również "rozszerzone wycinki" z trzecim parametrem "kroku": ``a[i:j:k]`` wybiera wszystkie elementy *a* o indeksie *x*, gdzie ``x = i + ​​n*k``, *n* ``>=`` ``0`` oraz *i* ``<=`` *x* ``<`` *j*.

source: Sequences are distinguished according to their mutability:
pl: Sekwencje można rozróżnić w zależności od ich mutowalności:

source: An object of an immutable sequence type cannot change once it is created. (If the object contains references to other objects, these other objects may be mutable and may be changed; however, the collection of objects directly referenced by an immutable object cannot change.)
pl: Obiekt sekwencji niemutowalnego typu nie może zostać zmieniony gdy już zostanie utworzony. (Jeśli obiekt zawiera odwołania do innych obiektów, te inne obiekty mogą być mutowalne i mogą ulec zmianie; jednakże, kolekcja obiektów do której bezpośrednio odwołuje się obiekt niemutowalny nie może się zmienić.)

source: The following types are immutable sequences:
pl: Następujące typy są niemutowalnymi sekwencjami:

source: The items of a string object are Unicode code units. A Unicode code unit is represented by a string object of one item and can hold either a 16-bit or 32-bit value representing a Unicode ordinal (the maximum value for the ordinal is given in ``sys.maxunicode``, and depends on how Python is configured at compile time). Surrogate pairs may be present in the Unicode object, and will be reported as two separate items. The built-in functions :func:`chr` and :func:`ord` convert between code units and nonnegative integers representing the Unicode ordinals as defined in the Unicode Standard 3.0. Conversion from and to other encodings are possible through the string method :meth:`encode`.
pl: Elementy obiektu ciągu znaków są jednostkami kodu Unicode. Jednostka kodu Unicode jest reprezentowana przez obiekt ciągu znaków składający się z jednej pozycji i może pomieścić zarówno 16-bitową jak też 32-bitową wartość reprezentującą liczbę porządkową Unicode (maksymalna wartość dla liczby porządkowej przechowywana jest w ``sys.maxunicode`` i zależy od tego, jak Python został skonfigurowany w czasie kompilacji). Zastępcze pary mogą być obecne w obiekcie Unicode, i zostaną zgłoszone jako dwa osobne elementy. Funkcje wbudowane :func:`chr` i :func:`ord` dokonują konwersji pomiędzy jednostkami kodu i nieujemnymi liczbami całkowitymi reprezentującymi liczby porządkowe Unicode jak określono w standardzie Unicode 3.0. Konwersja z i do innych kodowań jest możliwa dzięki metodzie operującej na ciągu znaków :meth:`encode`.

source: The items of a tuple are arbitrary Python objects. Tuples of two or more items are formed by comma-separated lists of expressions. A tuple of one item (a 'singleton') can be formed by affixing a comma to an expression (an expression by itself does not create a tuple, since parentheses must be usable for grouping of expressions). An empty tuple can be formed by an empty pair of parentheses.
pl: Elementy krotki mogą być dowolnymi obiektami Pythona. Krotki dwóch lub więcej elementów, są tworzone przez listy rozdzielanych przecinkami wyrażeń. Krotka składająca się z jednego elementu ('singleton' - jedynak) może być utworzona poprzez przytwierdzenie przecinka na końcu wyrażenia (wyrażenie samo nie tworzy krotki, gdyż nawiasy muszą być użyteczne przy grupowaniu wyrażeń). Pusta krotka może być utworzona przez pustą parę nawiasów.

source: A bytes object is an immutable array. The items are 8-bit bytes, represented by integers in the range 0 <= x < 256. Bytes literals (like ``b'abc'`` and the built-in function :func:`bytes` can be used to construct bytes objects. Also, bytes objects can be decoded to strings via the :meth:`decode` method.
pl: Obiekt bytes jest tablicą niemutowalną. Elementami są 8-bitowe bajty, reprezentowane przez liczby całkowite z przedziału 0 <= x < 256. Literały bajtowe (takie, jak ``b'abc'`` i wbudowana funkcja :func:`bytes` mogą być używane do konstruowania obiektów bytes. Można również poprzez metodę :meth:`decode` dekodować obiekty bytes do ciągów znaków.

source: Mutable sequences can be changed after they are created. The subscription and slicing notations can be used as the target of assignment and :keyword:`del` (delete) statements.
pl: Mutowalne sekwencje mogą być zmieniane po ich utworzeniu. Notacje indeksu dolnego i wycinków mogą być używane jako cel instrukcji przypisania i :keyword:`del` (usuwania).

source: There are currently two intrinsic mutable sequence types:
pl: Obecnie istnieją dwa główne rodzaje mutowalnych sekwencji:

source: The items of a list are arbitrary Python objects. Lists are formed by placing a comma-separated list of expressions in square brackets. (Note that there are no special cases needed to form lists of length 0 or 1.)
pl: Elementami listy mogą być dowolne obiekty Pythona. Listy są tworzone poprzez umieszczenie roddzielonej przecinkami listy wyrażeń w nawiasach kwadratowych. (Należy zauważyć, że nie ma szczególnych przypadków niezbędnych do utworzenia listy o długości 0 lub 1).

source: A bytearray object is a mutable array. They are created by the built-in :func:`bytearray` constructor. Aside from being mutable (and hence unhashable), byte arrays otherwise provide the same interface and functionality as immutable bytes objects.
pl: Obiekt bytearray jest mutowalną tablicą. Wbudowany konstruktor :func:`bytearray` używany jest do ich wytwarzenia. Poza tym, że są mutowalne (a więc nie nadają się do haszowania), tablice bajtów zasadniczo dostarczają ten sam interfejs i funkcjonalność, co niemutowalne obiekty bytes.

source: The extension module :mod:`array` provides an additional example of a mutable sequence type, as does the :mod:`collections` module.
pl: Moduł rozszerzający :mod:`array` zapewnia dodatkowy przykład mutowalnego typu sekwencyjnego, podobnie jak moduł :mod:`collections`.

source: These represent unordered, finite sets of unique, immutable objects. As such, they cannot be indexed by any subscript. However, they can be iterated over, and the built-in function :func:`len` returns the number of items in a set. Common uses for sets are fast membership testing, removing duplicates from a sequence, and computing mathematical operations such as intersection, union, difference, and symmetric difference.
pl: Te reprezentują nieuporządkowane, skończone zbiory niepowtarzalnych niemutowalnych obiektów. Jako takie, nie mogą być indeksowane jakimkolwiek indeksem dolnym. Jednakże, można po nich iterować, a wbudowana funkcja :func:`len` zwraca liczbę elementów w zbiorze. Typowym zastosowaniem dla zbiorów są szybkie testy przynależności, usuwanie duplikatów z sekwencji, i obliczanie działań matematycznych, takich jak część wspólna, suma, różnica, i różnica symetryczna.

source: For set elements, the same immutability rules apply as for dictionary keys. Note that numeric types obey the normal rules for numeric comparison: if two numbers compare equal (e.g., ``1`` and ``1.0``), only one of them can be contained in a set.
pl: Dla elementów zbioru, te same zasady niemutowalności obowiązują co w przypadku kluczy słownika. Należy zauważyć, że typy liczbowe przestrzegają zwykłych zasad numerycznego porównania: jeśli dwie liczby są równe (na przykład, ``1`` i ``1.0``), tylko jedna z nich może być zawarta w zbiorze.

source: There are currently two intrinsic set types:
pl: Obecnie istnieją dwa główne typy zbioru:

source: These represent a mutable set. They are created by the built-in :func:`set` constructor and can be modified afterwards by several methods, such as :meth:`add`.
pl: Stanowią one mutowalny zbiór. Są one tworzone przez wbudowany konstruktor :func:`zbioru` i mogą być modyfikowane później przez kilka metod, takich jak :meth:`add`.

source: These represent an immutable set. They are created by the built-in :func:`frozenset` constructor. As a frozenset is immutable and :term:`hashable`, it can be used again as an element of another set, or as a dictionary key.
pl: Stanowią one niemutowalny zbiór. Są one tworzone przez wbudowany konstruktor :func:`frozenset`. Ponieważ frozenset jest niemutowalny i: term:`haszowalny`, to może zostać ponownie użyty jako element innego zbioru, lub jako klucz słownika.

source: These represent finite sets of objects indexed by arbitrary index sets. The subscript notation ``a[k]`` selects the item indexed by ``k`` from the mapping ``a``; this can be used in expressions and as the target of assignments or :keyword:`del` statements. The built-in function :func:`len` returns the number of items in a mapping.
pl: Te oto reprezentują skończone zbiory obiektów zaindeksowane dowolnym zbiorem indeksowym. Notacja indeksu dolnego ``a[k]`` wybiera element indeksowany przez ``k`` z mapowania ``a``; te konstrukcje można stosować w wyrażeniach, instrukcji :keyword:`del` lub jako cel przypisań. Wbudowana funkcja :func:`len` zwraca liczbę elementów w mapowaniu.

source: There is currently a single intrinsic mapping type:
pl: Istnieje obecnie jeden wewnętrzny rodzaj dopasowania:
